---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameter.GetUnitTypeId
source: html/25dccc46-0885-7983-6d0d-87b94c153b8d.htm
---
# Autodesk.Revit.DB.FamilyParameter.GetUnitTypeId Method

Gets the identifier of the unit quantifying the parameter value.

## Syntax (C#)
```csharp
public ForgeTypeId GetUnitTypeId()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if this parameter is not of value type.